dimitrioskyranos/ee3-code/ESP32_Code/C_Code/Speaker/joystick-motor-servo-speaker-servoZ-servoGrab/src/main.c
    #include <stdio.h>
    #include <string.h>
    #include "freertos/FreeRTOS.h"
    #include "freertos/task.h"
    #include "driver/spi_master.h"
    #include "esp_log.h"
    #include "driver/gpio.h"
    #include "nrf24.h"
    #include <stdint.h>
    #include <stddef.h>
    #include "driver/ledc.h"
    #include "esp_err.h"
    #include <math.h>

    
    #define IN1 7
    #define IN2 5
    #define ENA 6  // PWM channel 0
    // Motor B pins
    #define IN3 17
    #define IN4 15
    #define ENB 16  // PWM channel 1

    // PWM configuration
    #define PWM_FREQ 1000
    #define PWM_RES LEDC_TIMER_8_BIT
    #define MAX_DUTY_CYCLE 255


    //NRF CONFIG
    #define SPI_HOST       SPI2_HOST
    #define DMA_CHANNEL    0
    #define MOSI_PIN       13
    #define MISO_PIN       12
    #define SCLK_PIN       14
    #define CS_PIN         11
    #define CE_PIN         4 





#define SERVO_X_PIN 42       // GPIO pin for Servo X
#define SERVO_Y_PIN 41       // GPIO pin for Servo Y
#define SERVO_X_CHANNEL LEDC_CHANNEL_2  // PWM channel for Servo X
#define SERVO_Y_CHANNEL LEDC_CHANNEL_3  // PWM channel for Servo Y
#define SERVO_Z_PIN 40
#define SERVO_GRAB 39 
#define SERVO_Z_CHANNEL LEDC_CHANNEL_4 

// Servo PWM configuration
#define SERVO_FREQ 50       // 50 Hz (standard for servos)
#define SERVO_RES LEDC_TIMER_13_BIT  // 13-bit resolution for finer control
#define SERVO_MIN_DUTY_X 163  // Duty cycle for 0 degrees (1 ms pulse)
#define SERVO_MAX_DUTY_X 819  // Duty cycle for 180 degrees (2 ms pulse)
#define SERVO_MIN_DUTY_Y 163  // Duty cycle for 0 degrees (1 ms pulse)
#define SERVO_MAX_DUTY_Y 600  // Duty cycle for 180 degrees (2 ms pulse)
#define SERVO_MIN_DUTY_Z 605  // Duty cycle for 0 degrees (1 ms pulse)
#define SERVO_MAX_DUTY_Z 820  // Duty cycle for 180 degrees (2 ms pulse)
#define SERVO_NEUTRAL_DUTY_X 491  // Duty cycle for 90 degrees (1.5 ms pulse)
#define SERVO_NEUTRAL_DUTY_Y 350
#define SERVO_NEUTRAL_DUTY_Z 499  

#define SERVO_MIN_DUTY_G 601  // Duty cycle for 0 degrees (1 ms pulse)
#define SERVO_MAX_DUTY_G 823 
#define SERVO_NEUTRAL_DUTY_G 492

//servoPositionsLast
int lastX = SERVO_NEUTRAL_DUTY_X;
int lastY = SERVO_NEUTRAL_DUTY_Y;
int lastZ = SERVO_NEUTRAL_DUTY_Z;
int lastG = SERVO_NEUTRAL_DUTY_G;

 
#define SERVO_G_CHANNEL LEDC_CHANNEL_7 
// Adjust how fast the servo moves (tune this value as needed)
#define SERVO_SPEED_SCALING 6  // Higher = faster movement


// Speaker Constants
#define SPEAKER_PIN 38
#define SWITCH_PIN 37
#define SPEAKER_RES LEDC_TIMER_10_BIT
#define SPEAKER_FREQ1 600
#define SPEAKER_FREQ2 900
#define SPEAKER_DUTY 512 
#define SPEAKER_CHANNEL LEDC_CHANNEL_5 
volatile bool siren_active = false;  // Flag to track button press state
bool servoZ_toggled = false;
bool servoG_toggled = false;

    spi_device_handle_t spi;

    uint8_t TxAddress[] = {0xE7, 0xE7, 0xE7, 0xE7, 0xE7};
    uint8_t DataTx[] = "Hello, world";
    uint8_t RxData[32];

    static const char *TAG = "SPI_MASTER";

    void spi_initialization()
    {
        // SPI bus configuration
        spi_bus_config_t buscfg = {
            .mosi_io_num = MOSI_PIN,
            .miso_io_num = MISO_PIN,
            .sclk_io_num = SCLK_PIN,
            .quadwp_io_num = -1,
            .quadhd_io_num = -1,
            
        };

        // Initialize the SPI bus
        ESP_ERROR_CHECK(spi_bus_initialize(SPI_HOST, &buscfg, DMA_CHANNEL));

        // SPI device configuration
        spi_device_interface_config_t devcfg = {
            .clock_speed_hz = 500 * 1000, // Start with 500 kHz
            .mode = 0,                         // SPI Mode 0 (CPOL = 0, CPHA = 0)
            .spics_io_num = CS_PIN,            // CS pin
            .queue_size = 7, 
            .flags = SPI_DEVICE_NO_DUMMY,                        // MSB first (default)
        };

        // Add the SPI device
        ESP_ERROR_CHECK(spi_bus_add_device(SPI_HOST, &devcfg, &spi));

        ESP_LOGI(TAG, "SPI Master initialized for NRF24L01");
    }

    void espNRFPins(){
         // config CS
        gpio_reset_pin(CS_PIN);
        gpio_set_direction(CS_PIN, GPIO_MODE_OUTPUT);
        // config CE
        gpio_reset_pin(CE_PIN);
        gpio_set_direction(CE_PIN, GPIO_MODE_OUTPUT);
        CS_unselect();
        CE_disable();
    }


void setup_switch() {
    gpio_config_t switch_conf = {
        .pin_bit_mask = (1ULL << SWITCH_PIN),
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = GPIO_PULLUP_ENABLE,  // Enable internal pull-up resistor
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE
    };
    gpio_config(&switch_conf);
}

    // Function to initialize the servo
    void setup_servo() {
        // Configure PWM timer for the servos
        ledc_timer_config_t servo_timer = {
            .speed_mode = LEDC_LOW_SPEED_MODE,
            .timer_num = LEDC_TIMER_1,  // Use a different timer for the servos
            .duty_resolution = SERVO_RES,
            .freq_hz = SERVO_FREQ,
            .clk_cfg = LEDC_AUTO_CLK
        };
        ledc_timer_config(&servo_timer);

        
    
        // Configure PWM channel for Servo X
        ledc_channel_config_t servoX_channel = {
            .gpio_num = SERVO_X_PIN,
            .speed_mode = LEDC_LOW_SPEED_MODE,
            .channel = SERVO_X_CHANNEL,
            .timer_sel = LEDC_TIMER_1,
            .duty = SERVO_NEUTRAL_DUTY_X,  // Start at neutral position
            .hpoint = 0
        };
        ledc_channel_config(&servoX_channel);

    
        // Configure PWM channel for Servo Y
        ledc_channel_config_t servoY_channel = {
            .gpio_num = SERVO_Y_PIN,
            .speed_mode = LEDC_LOW_SPEED_MODE,
            .channel = SERVO_Y_CHANNEL,
            .timer_sel = LEDC_TIMER_1,
            .duty = SERVO_NEUTRAL_DUTY_Y,  // Start at neutral position
            .hpoint = 0
        };
        ledc_channel_config(&servoY_channel);

        ledc_channel_config_t servoZ_channel = {
            .gpio_num = SERVO_Z_PIN,
            .speed_mode = LEDC_LOW_SPEED_MODE,
            .channel = SERVO_Z_CHANNEL,
            .timer_sel = LEDC_TIMER_1,
            .duty = SERVO_NEUTRAL_DUTY_Z,  // Start at neutral position
            .hpoint = 0
        };
        ledc_channel_config(&servoZ_channel);

