dimitrioskyranos/ee3-code/ESP32_Code/C_Code/Speaker/joystick-motor-servo-speaker-servoZ-servoGrab/src/main.c
        ledc_channel_config_t servoG_channel = {
            .gpio_num = SERVO_GRAB,
            .speed_mode = LEDC_LOW_SPEED_MODE,
            .channel = SERVO_G_CHANNEL,
            .timer_sel = LEDC_TIMER_1,
            .duty = SERVO_NEUTRAL_DUTY_G,  // Start at neutral position
            .hpoint = 0
        };
        ledc_channel_config(&servoG_channel);
    }


    void setup_pwm() {
    // Configure PWM for Motor A
    ledc_timer_config_t ledc_timer = {
        .speed_mode       = LEDC_LOW_SPEED_MODE,
        .timer_num        = LEDC_TIMER_0,
        .duty_resolution  = PWM_RES,
        .freq_hz          = PWM_FREQ,
        .clk_cfg          = LEDC_AUTO_CLK
    };
    ledc_timer_config(&ledc_timer);

    ledc_channel_config_t motorA_channel = {
        .gpio_num   = ENA,
        .speed_mode = LEDC_LOW_SPEED_MODE,
        .channel    = LEDC_CHANNEL_0,
        .timer_sel  = LEDC_TIMER_0,
        .duty       = 0,
        .hpoint     = 0
    };
    ledc_channel_config(&motorA_channel);

    // Configure PWM for Motor B
    ledc_channel_config_t motorB_channel = {
        .gpio_num   = ENB,
        .speed_mode = LEDC_LOW_SPEED_MODE,
        .channel    = LEDC_CHANNEL_1,
        .timer_sel  = LEDC_TIMER_0,
        .duty       = 0,
        .hpoint     = 0
    };
    ledc_channel_config(&motorB_channel);
    
    }


    void setup_speaker(){
        ledc_timer_config_t speaker_timer = {
            .speed_mode = LEDC_LOW_SPEED_MODE,
            .timer_num = LEDC_TIMER_2,  // Use a different timer for the servos
            .duty_resolution = SPEAKER_RES,
            .freq_hz = SPEAKER_FREQ1,
            .clk_cfg = LEDC_AUTO_CLK
        };
        ledc_timer_config(&speaker_timer);
        // Configure PWM channel for Servo X
        ledc_channel_config_t speaker_channel = {
            .gpio_num = SPEAKER_PIN,
            .speed_mode = LEDC_LOW_SPEED_MODE,
            .channel = SPEAKER_CHANNEL,
            .timer_sel = LEDC_TIMER_2,
            .duty = 0,  // Start silent
            .hpoint = 0
        };
        ledc_channel_config(&speaker_channel);
    }




    void setup_gpio() {
    gpio_config_t io_conf = {
        .pin_bit_mask = (1ULL << IN1) | (1ULL << IN2) | (1ULL << IN3) | (1ULL << IN4),
        .mode = GPIO_MODE_OUTPUT,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE
    };
    gpio_config(&io_conf);
    }


    void siren_task(void *arg) {
        uint32_t current_freq = SPEAKER_FREQ1;
    
        while (1) {
            if (siren_active) {
                // Toggle frequency between 2kHz and 3kHz
                current_freq = (current_freq == SPEAKER_FREQ1) ? SPEAKER_FREQ2 : SPEAKER_FREQ1;
                ledc_set_freq(LEDC_LOW_SPEED_MODE, LEDC_TIMER_2, current_freq);
                ledc_set_duty(LEDC_LOW_SPEED_MODE, SPEAKER_CHANNEL, SPEAKER_DUTY);  // Enable sound
                ledc_update_duty(LEDC_LOW_SPEED_MODE, SPEAKER_CHANNEL);
            } else {
                // Mute speaker when conditions are not met
                ledc_set_duty(LEDC_LOW_SPEED_MODE, SPEAKER_CHANNEL, 0);
                ledc_update_duty(LEDC_LOW_SPEED_MODE, SPEAKER_CHANNEL);
            }
            vTaskDelay(pdMS_TO_TICKS(400));  // Switch frequency every 400ms
        }
    }


    void set_motorA(bool forward, int speed) {
    gpio_set_level(IN1, forward ? 1 : 0);
    gpio_set_level(IN2, forward ? 0 : 1);
    ledc_set_duty(LEDC_LOW_SPEED_MODE, LEDC_CHANNEL_0, speed);
    ledc_update_duty(LEDC_LOW_SPEED_MODE, LEDC_CHANNEL_0);
    }

    void set_motorB(bool forward, int speed) {
    gpio_set_level(IN3, forward ? 1 : 0);
    gpio_set_level(IN4, forward ? 0 : 1);
    ledc_set_duty(LEDC_LOW_SPEED_MODE, LEDC_CHANNEL_1, speed);
    ledc_update_duty(LEDC_LOW_SPEED_MODE, LEDC_CHANNEL_1);
    }


    void control_servo_toggle(uint8_t switch_value, ledc_channel_t servo_channel) {
        static bool lastSwitchState = true;  // Track previous switch state (true = idle, false = pressed)
        
        if (servo_channel == SERVO_Z_CHANNEL) {
            // Detect a transition from 0xFF (idle) to 0x00 (pressed)
            if (switch_value == 0x00 && lastSwitchState) {
                servoZ_toggled = !servoZ_toggled; // Toggle the state
    
                int new_position = servoZ_toggled ? SERVO_MAX_DUTY_Z : SERVO_MIN_DUTY_Z;
                lastZ = new_position; // Update last position
    
                ledc_set_duty(LEDC_LOW_SPEED_MODE, servo_channel, new_position);
                ledc_update_duty(LEDC_LOW_SPEED_MODE, servo_channel);
            }
    
            lastSwitchState = (switch_value == 0xFF);  // Update last state
        }
    }


    void control_servo_toggle_grab(uint8_t switch_value, ledc_channel_t servo_channel) {
        static bool lastSwitchGrabState = true;  // Track previous grab button state (true = idle, false = pressed)
        
        if (servo_channel == SERVO_G_CHANNEL) {
            // Detect a transition from 0xFF (idle) to 0x00 (pressed)
            if (switch_value == 0x00 && lastSwitchGrabState) {
                servoG_toggled = !servoG_toggled; // Toggle the state
    
                int new_position = servoG_toggled ? SERVO_MAX_DUTY_G : SERVO_MIN_DUTY_G;
                lastG = new_position; // Update last position
    
                ledc_set_duty(LEDC_LOW_SPEED_MODE, servo_channel, new_position);
                ledc_update_duty(LEDC_LOW_SPEED_MODE, servo_channel);
            }
    
            lastSwitchGrabState = (switch_value == 0xFF);  // Update last state
        }
    }
    


// Function to control the servo based on servoX value
void control_servo(uint8_t servo_value, ledc_channel_t servo_channel) {
    int min = 0;
    int max = 0;
    int* lastPos = NULL;  // Pointer to last position variable

    // Identify servo channel and assign corresponding parameters
    if (servo_channel == SERVO_X_CHANNEL) {
        min = SERVO_MIN_DUTY_X;
        max = SERVO_MAX_DUTY_X;
        lastPos = &lastX;
    } 
    else if (servo_channel == SERVO_Y_CHANNEL) {
        min = SERVO_MIN_DUTY_Y;
        max = SERVO_MAX_DUTY_Y;
        lastPos = &lastY;
    } 
    // If joystick is centered, do nothing (hold last position)
    if (servo_value == 0x80) {
        return;
    }

    // Calculate movement step based on joystick deviation
    int step = ((servo_value - 0x80) / SERVO_SPEED_SCALING); 

