dimitrioskyranos/ee3-code/ESP32_Code/C_Code/Speaker/joystick-motor-servo-speaker-servoZ-servoGrab/src/main.c
    // Adjust last position gradually
    *lastPos += step;

    // Clamp the position within allowed servo limits
    if (*lastPos < min) *lastPos = min;
    if (*lastPos > max) *lastPos = max;

    // Set the duty cycle for the servo
    ledc_set_duty(LEDC_LOW_SPEED_MODE, servo_channel, *lastPos);
    ledc_update_duty(LEDC_LOW_SPEED_MODE, servo_channel);
}


void control_motors(uint8_t x, uint8_t y) {
    int speedA = 0;
    int speedB = 0;
    bool forwardA = true;
    bool forwardB = true;

    // // Forward/Backward logic
    // if (y < 0x80) {
    //     // Joystick Up: Both motors move forward
    //     speedA = (0x80 - y) * 2; // Speed increases as y decreases
    //     speedB = (0x80 - y) * 2;
    //     forwardA = true;
    //     forwardB = true;
    // } else if (y > 0x80) {
    //     // Joystick Down: Both motors move backward
    //     speedA = (y - 0x80) * 2; // Speed increases as y increases
    //     speedB = (y - 0x80) * 2;
    //     forwardA = false;
    //     forwardB = false;
    // }

    // // Left/Right logic
    // if (x < 0x80) {
    //     // Joystick Left: Only Motor B moves forward
    //     speedA = 0; // Motor A is stopped
    //     speedB = (0x80 - x) * 2; // Speed increases as x decreases
    //     forwardA = true; // Doesn't matter since speedA is 0
    //     forwardB = true;
    // } else if (x > 0x80) {
    //     // Joystick Right: Only Motor A moves forward
    //     speedA = (x - 0x80) * 2; // Speed increases as x increases
    //     speedB = 0; // Motor B is stopped
    //     forwardA = true;
    //     forwardB = true; // Doesn't matter since speedB is 0
    // }

    // // Ensure the speeds are within the valid range
    // speedA = (speedA < 0) ? 0 : (speedA > MAX_DUTY_CYCLE) ? MAX_DUTY_CYCLE : speedA;
    // speedB = (speedB < 0) ? 0 : (speedB > MAX_DUTY_CYCLE) ? MAX_DUTY_CYCLE : speedB;

    

    // // Set the motor speeds and directions
    // set_motorA(forwardA, speedA);
    // set_motorB(forwardB, speedB);



    if(y < 0x80 && x > 0x80){
        speedA = sqrt(pow((y - 0x80)*16, 2) + pow((x-0x80)*16, 2));
        speedB = (y - 0x80) * 16;
        forwardA = true;
        forwardB = true;
       } else if(y < 0x80 && x < 0x80){
        speedA = (y - 0x80) * 16;
        speedB = sqrt(pow((y - 0x80)*16, 2) + pow((x-0x80)*16, 2));
        forwardA = false;
        forwardB = false;
       } else if(y > 0x80 && x < 0x80 ){
        speedA = sqrt(pow((0x80 - y)*16,2) + pow((x-0x80)*16,2));
        speedB = (120 - y) * 16;
        forwardA = true;
        forwardB = true;
       } else if(y > 0x80 && x > 0x80){
        speedA = (0x80 - y) * 16;
        speedB = sqrt(pow((0x80 - y)*16,2) + pow((x-0x80)*16,2));
        forwardA = true;
        forwardB = true;
       } else if(y > 0x80){
        speedA = (y - 0x80) * 16;
        speedB = (y - 0x80) * 16;
        forwardA = true;
        forwardB = true;
       } else if(y < 0x80){
        speedA = (0x80 - y) * 16;
        speedB = (0x80 - y) * 16;
        forwardA = false;
        forwardB = false;
       } else {
        speedA = 0;
        speedB = 0;
        forwardA = true;
        forwardB = true;
       }

           // // Ensure the speeds are within the valid range
     speedA = (speedA < 0) ? 0 : (speedA > MAX_DUTY_CYCLE) ? MAX_DUTY_CYCLE : speedA;
     speedB = (speedB < 0) ? 0 : (speedB > MAX_DUTY_CYCLE) ? MAX_DUTY_CYCLE : speedB;

    

     // Set the motor speeds and directions
     set_motorA(forwardA, speedA);
     set_motorB(forwardB, speedB);

}





    void app_main(void)
    {
        //catch everything on the serial monitor delay
        vTaskDelay(4000 / portTICK_PERIOD_MS);
        ESP_LOGE(TAG,"Start to control the motors over nrf24");    


        spi_initialization();
        setup_pwm();  // Initialize PWM
        setup_gpio(); //GPIO Pins init
        setup_servo();
        setup_speaker();
        setup_switch();

        xTaskCreate(siren_task, "siren_task", 2048, NULL, 5, NULL);




        espNRFPins();


        init_NRF();
        NRF24_RxMode(TxAddress, 122);

        
        uint8_t joystickX, joystickY, servoX, servoY, servoSwitch,grabButton;
       


        while(1)
        {
            
            if(isDataAvailable(1) == 1)
            {
                NRF24_Receive(RxData);

                joystickY = RxData[1];
                joystickX = RxData[0];
                servoX = RxData[2];
                servoY = RxData[3];
                servoSwitch = RxData[4];
                grabButton = RxData[5];

            

                control_motors(joystickX, joystickY);

                // Control servos
            control_servo(servoX, SERVO_X_CHANNEL);  // Control Servo X
            control_servo(servoY, SERVO_Y_CHANNEL);  // Control Servo Y
            control_servo_toggle(servoSwitch, SERVO_Z_CHANNEL);

            control_servo_toggle_grab(grabButton, SERVO_G_CHANNEL);



            bool switch_pressed = (gpio_get_level(SWITCH_PIN) == 0);  // LOW = pressed
            bool car_moving = (joystickX != 0x80 || joystickY != 0x80);  // Check if motors are moving
            siren_active = switch_pressed && car_moving;

                ESP_LOGI(TAG, "Joystick X: %d, Y: %d", joystickX, joystickY);
                ESP_LOGI(TAG, "Servo X: %d, Y: %d", servoX, servoY);
                // vTaskDelay(pdMS_TO_TICKS(200));
                // ESP_LOGI(TAG, "Servo Grab: %d", grabButton);
                // ESP_LOGI(TAG, "servoSwitch: %d", servoSwitch);

                vTaskDelay(pdMS_TO_TICKS(20));
            
                
            }
                

            
        }
    }

    uint8_t SPI_ByteExchange(uint8_t data) {
        uint8_t receivedByte = 0;

        spi_transaction_t trans = {
            .length = 8,            // 8 bits to send
            .tx_buffer = &data,     // Data to transmit
            .rx_buffer = &receivedByte, // Buffer for received data
        };

        ESP_ERROR_CHECK(spi_device_transmit(spi, &trans));
        return receivedByte;
    }
    
    void CS_select(void) {
        gpio_set_level(CS_PIN, 0);
    }

    void CS_unselect(void) {
        gpio_set_level(CS_PIN, 1);
    }

    void CE_enable(void) {
        gpio_set_level(CE_PIN, 1);
    }

    void CE_disable(void) {
        gpio_set_level(CE_PIN, 0);
    }

    void nrf24_writeReg(uint8_t reg, uint8_t data) {
        uint8_t buf[2];
        buf[0] = reg | (1 << 5);  // Register + W_REGISTER command
        buf[1] = data;
        
        // Put CS pin low to select device
        CS_select();
        SPI_ByteExchange(buf[0]);
        SPI_ByteExchange(buf[1]);
        CS_unselect();
    }

    void nrf24_writeRegMulti(uint8_t reg, uint8_t *data, size_t size) {
        uint8_t buf[2];
        buf[0] = reg | (1 << 5);  // Register + W_REGISTER command
        // Put CS pin low to select device
        CS_select();
        SPI_ByteExchange(buf[0]); 
        for (int i = 0; i<size; i++){
//       while (SPI1CON2bits.BUSY);
       SPI_ByteExchange(data[i]); 
        }
        CS_unselect();
    }

    uint8_t nrf24_readReg(uint8_t reg)
    {
        uint8_t data_read = 0;
        //Put CS pin low to select device
        CS_select();
        SPI_ByteExchange(reg);
        data_read = SPI_ByteExchange(0xff);
        CS_unselect();
        
        return data_read;
    }


    void nrfsendCmd(uint8_t cmd) {
        CS_select();
        SPI_ByteExchange(cmd);
        CS_unselect();
    }

    void init_NRF(void) {
        CE_disable();

